{"took":18,"timed_out":false,"_shards":{"total":5,"successful":5,"skipped":0,"failed":0},"hits":{"total":52,"max_score":1.0,"hits":[{"_index":"recipes","_type":"recipes","_id":"iQZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"seitan stir-fry with black bean garlic sauce","ingredients":["2 cups boiling water","1 ounce dried shiitake mushrooms","2 tablespoons chinese rice wine or sake","2 tablespoons black bean garlic sauce","2 teaspoons cornstarch","2 tablespoons canola oil"," divided","2 cups thinly sliced drained seitan"," about 8 ounces","1 tablespoon finely chopped garlic","1 tablespoon finely chopped peeled fresh ginger","4 cups 2-inch-cut green beans (about 1 pound)","2 cups hot cooked brown rice","¼ teaspoon salt","cilantro sprigs (optional)"],"instructions":["combine 2 cups boiling water and mushrooms in a small bowl; cover and let stand for 20 minutes. drain in a colander over a bowl, reserving ½ cup soaking liquid. rinse mushrooms; drain well. discard mushroom stems; thinly slice mushroom caps. combine reserved liquid, rice wine, black bean sauce, and cornstarch in a small bowl; stir with a whisk, and set mixture aside. heat 1 tablespoon canola oil in a large nonstick skillet or wok over medium-high heat.","add seitan to pan and stir-fry 2 minutes or until lightly browned. place seitan in a medium bowl. heat remaining 1 tablespoon oil in pan over medium-high heat. add garlic and ginger to pan; stir-fry for 30 seconds. add mushrooms and beans; cover and cook 3 minutes. add black bean sauce mixture to pan; cook 1 minute or until sauce slightly thickens. add seitan to pan; cook 1 minute, stirring occasionally. combine rice and salt; serve seitan mixture over rice. garnish with cilantro sprigs, if desired."],"tags":"black bean sauce"}},{"_index":"recipes","_type":"recipes","_id":"iwZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"black rice, corn and cranberries","ingredients":["1 cup black rice or wild rice","3 tablespoons olive oil or other healthy vegetable oil","3 to 4 cloves garlic"," minced","3 to 4 scallions"," green and white parts"," thinly sliced","2 cups thawed frozen corn kernels","¼ cup lemon or lime juice"," or to taste","¼ to ½ cup chopped cilantro leaves"," to taste","2 teaspoons ground cumin","½ teaspoon dried oregano","¼ teaspoon dried thyme","½ cup dried cranberries","salt and freshly ground pepper to taste","¼ cup toasted pumpkin seeds for topping"],"instructions":["if using black rice, combine in a saucepan with 2 cups water. bring to a rapid simmer, then lower the heat, cover, and simmer gently until the water is absorbed, about 30 minutes. if you’d like a more tender grain, add 1/2 cup additional water and cook until absorbed. if using wild rice, combine with 3 cups of water and cook as directed above.","just before the rice is done, heat half the oil in a large skillet. add the garlic and sauté over low heat until golden. add the scallions and corn kernels and sauté just until warmed through.","transfer the cooked rice to the skillet. turn the heat up to medium-high, then add the lime juice, cilantro, cumin, oregano, thyme, cranberries, and remaining oil. gently stir the mixture, then season to taste with salt and pepper.","to serve, transfer to an attractive serving platter and sprinkle the pumpkin seeds over the top."],"tags":"fall"}},{"_index":"recipes","_type":"recipes","_id":"kQZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"tahini ginger dressing","ingredients":["1/2 cup tahini (sesame paste) 1/2 cup olive oil","1/2 cup water 1/4 cup tamari (dark soy sauce) 2 tablespoons red wine vinegar 2 tablespoons lemon juice","2 teaspoons minced fre"],"instructions":"Blend the tahini, olive oil, water, tamari, red wine vinegar, lemon juice, ginger, garlic, and black pepper together in a blender until smooth.","tags":"dressing"}},{"_index":"recipes","_type":"recipes","_id":"lwZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Yam Bowl","ingredients":["Roasted Yams","Summer Squash","Salsa","Easy Pickled Onions","Martooni Peppers","Lettuce","Tomatoes","Limes","Avocado","Favorite Beans or Chile","Olives","Santa Fe Trail Mix"],"instructions":"list()","tags":["fall","summer"]}},{"_index":"recipes","_type":"recipes","_id":"ngZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"parsley, beetroot and black quinoa salad","ingredients":["8 small (or 4 medium) beetroots"," scrubbed clean but skin left on","3 tbsp olive oil","150g black quinoa"," rinsed","100g parsley"," finely chopped","15g mint"," shredded","5 spring onions"," finely chopped","½ medium cucumber"," cut in half lengthways"," then cut widthways into thin slices","2 tsp nigella seeds","1 tsp allspice","2 lemons"," skin"," pith and seeds discarded"," flesh finely chopped","salt","for the dressing:","1 clove garlic"," peeled and roughly chopped","2 green chillies"," deseeded and roughly chopped","2 tbsp olive oil"],"instructions":["heat the oven to 200c/390f/gas mark 6. to make the dressing, crush the garlic and chilli in a pestle and mortar with half a teaspoon of salt. slowly pour in the oil, crushing all the while, until you have a thick dressing, and set aside.","mix the beetroot with a tablespoon of oil and spread out on a medium baking tray. roast for 40-50 minutes, until a knife goes through smoothly, remove and, once cool enough to handle, don’t peel them, but cut into quarters if small, or 2cm-wide wedges.","cover the quinoa with plenty of water and bring to the boil. stir once, reduce the heat to medium and simmer for 15 minutes, until cooked but still retaining a bite. drain, refresh under running water and set aside to dry well.","transfer the quinoa to a large bowl and add the herbs, spring onion, cucumber, spices and lemon flesh. pour over the dressing and ¼ teaspoon of salt. mix together and then spread out on a large platter. dot the beetroot on top, drizzle with the remaining olive oil and serve."],"tags":null}},{"_index":"recipes","_type":"recipes","_id":"owZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Walnut Date Pinwheel cookies","ingredients":["1 (10-ounce) package chopped dates","3/4 cup sugar"," divided","1/2 cup water","1/4 teaspoon salt"," divided","1 cup chopped walnuts","1/2 cup butter or margarine"," softened","1/2 cup firmly packed brown sugar","1 large egg","1/2 teaspoon vanilla extract","2 cups all-purpose flour","1/4 teaspoon baking soda"],"instructions":["Stir together dates, 1/4 cup sugar, 1/2 cup water, and 1/8 teaspoon salt in a saucepan; bring mixture to a boil over medium-high heat. Reduce heat; simmer 3 to 5 minutes. Remove from heat; stir in walnuts, and set aside.","","Beat remaining 1/2 cup sugar, softened butter, and brown sugar at medium speed with an electric mixer until light and fluffy.","","Add egg and vanilla, beating until blended. Gradually add remaining 1/8 teaspoon salt, flour, and baking soda, beating until blended. Cover and chill 1 hour.","","Turn dough out onto floured wax paper, and roll into an 18- x 12-inch rectangle. Spread date mixture evenly over dough, leaving a 1/2-inch border.","","Roll up dough jellyroll fashion, beginning at 1 long side. Wrap in wax paper, and chill 1 hour.","","Cut roll into 1/4-inch-thick slices; place on lightly greased baking sheets.","","Bake, in batches, at 375° for 12 to 14 minutes or until lightly browned. Cool cookies 2 to 3 minutes on baking sheets, and remove to wire racks to cool completely."],"tags":"sweets"}},{"_index":"recipes","_type":"recipes","_id":"pgZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"flax egg","ingredients":["","1 Tbsp (7 g) flaxseed meal (ground raw flaxseed)","2 1/2 Tbsp (37 ml) water"],"instructions":["","Add flaxseed meal and water to a dish and stir. Let rest for 5 minutes to thicken. Add to recipes in place of 1 egg.","It's not an exact 1:1 substitution in every recipe because it doesn't bind and stiffen during baking quite like an egg does. But I've found it to work incredibly well in pancakes, quick breads, brownies, muffins, cookies, and many other recipes."],"tags":"justin treats"}},{"_index":"recipes","_type":"recipes","_id":"qQZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Israeli Couscous, Eggplant and Tomato Gratin ","ingredients":["","1 ½ pounds eggplant (2 medium globe eggplants or 4 to 6 smaller or Japanese eggplants)"," sliced into rounds"," about 1/3 inch thick","Salt to taste","3 tablespoons extra- virgin olive oil (plus additional for oiling the foil and baking dish)","2 cups cooked Israeli couscous (see below). You can also use regular couscous or any other cooked grain.","2 cups fresh tomato sauce or marinara sauce made from canned tomatoes","2 ounces Parmesan cheese"," grated (1/2 cup"," tightly packed)","Torn or slivered basil leaves for garnish"],"instructions":["","Preheat oven to 450 degrees. Line a baking sheet with foil and coat foil generously with olive oil. Toss eggplant slices with salt to taste and 2 tablespoons of the olive oil. Line baking sheet with the slices in a single layer (you may need 2 baking sheets, or do this in batches). Place in oven and roast for 15 minutes. Eggplant will look dry on surface but should be soft when pierced with a knife. Remove from oven and, wearing oven mitts, carefully fold the foil up in half over the eggplant and crimp edges to create a sealed packet. Allow eggplant to steam inside the packet for another 15 minutes (you can cook couscous during this time). Turn oven down to 375 degrees.","Oil a 2-quart gratin or baking dish with olive oil. Place cooked Israeli couscous in a bowl and stir in 1/2 cup of the tomato sauce. Spoon into baking dish in an even layer.","Remove eggplant slices from foil packet (they should be thoroughly tender), and layer on top of couscous, overlapping slices slightly. Cover with remaining tomato sauce and sprinkle on Parmesan cheese. Drizzle on remaining tablespoon of olive oil. Place in oven and bake 30 minutes, until browned and bubbling. Allow to sit for at least 10 minutes before serving. Sprinkle with torn or slivered basil leaves just before serving.","","Tip","","Heat a large saucepan over medium-high heat and add 1 cup Israeli couscous. Toast the couscous, shaking the pan or stirring often, until it colors very lightly and smells aromatic and toasty, a bit like popcorn. Immediately add 2 quarts water and salt to taste (be generous, as if you are cooking pasta) and boil 10 minutes, until the couscous is al dente; it should not be mushy and there should still be plenty of water in the pot. Drain through a strainer and rinse with cold water. Tap the strainer against the sink to drain well, then return the couscous to the pot, cover the pot with a kitchen towel, and return the lid. Let sit for 10 minutes. Measure out 2 cups and proceed with recipe.","","Cooking Notes","Add photo","500","Who can see this note? Everyone Only You","","All34","Most Helpful8","Private Notes0","","T. Smith 2 years ago","Liked this way of cooking the eggplant, and disagree with the writer who said it was too much for a weeknight. If you have te marinara prepared then it is essentially only three components.  However, I felt it was a little under seasoned. Next time I will try adding a layer of grated cheese and chopped thyme between the couscous and eggplant.","Reply","13This is helpful","maryea@gmail.com 2 years ago","I'll make this with my own tomato sauce and love what I learned:","","a) Put olive oil on foil; turn eggplant (or whatever) in the oil rather than spraying with my home-olive-oil sprayer.","","b) How to cook eggplant for other dishes.","Reply","11This is helpful","Linda 6 months ago","I embellished this recipe by adding a \"layer\" of sautéed onion, garlic, mushrooms and fresh spinach. The marinara sauce was full bodied with lots of garlic and a splash of red wine. I used bulgur because that's what I had. The bulgur really needed the extra kick of flavor. I topped with a little pesto and the next day for leftovers added some fresh mozzarella which was delicious! The prep for eggplant is genius!!! Thank you!","Reply","9This is helpful","Jim Council 2 years ago","This is s very forgiving recipe. I had quinois, so used that rather than cous cous. Did not measure anything. Instead of tossing the eggplant in oil, I just plopped it on the oiled foil and then flipped it. Reduced recipe to fit my gratin dish. Also mixed the tomato sauce and quinois in the gratin dish instead of a separate bowl. I even misread the recipe and baked the egplant at 350 rather than 450 degrees. It still turned out delicious."],"tags":["casseroles","justin friendly"]}},{"_index":"recipes","_type":"recipes","_id":"rAZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Sweet Potato Hash","ingredients":["","1 tablespoon extra virgin olive oil"," plus more for cooking","1/2 cup diced onion","1 bell pepper"," chopped","1 clove garlic"," minced","1 small sweet potato"," chopped into small cubes","1 tablespoon harissa paste","1/2 teaspoon smoked paprika","1/2 teaspoon cumin","1/4 teaspoon salt","1/8 teaspoon black pepper","1 cup packed baby spinach","1/2 cup black beans"," drained and rinsed","2 eggs","1 green onion"," chopped"],"instructions":["","","Add 1 tablespoon olive oil to a skillet over medium heat. Once hot, add the onions and let cook 2-3 minutes until softened.","","Add the peppers and garlic and cook an additional 3-4 minutes until softened.","","Add sweet potato, harissa paste, all the spices and a drizzle more of the olive oil. Toss to combine and cook until the potatoes are fork tender and softened, about 5-7 minutes.","","Add the spinach and black beans to the skillet, toss and cook until spinach is wilted.","","Crack the eggs over the top of the hash, cover with a lid and cook until egg whites are set.","","Remove the lid, season with additional salt and pepper. Sprinkle the chopped green onion on top and serve."],"tags":"breakfast"}},{"_index":"recipes","_type":"recipes","_id":"rgZnPWMBIdwOg9CN2gfD","_score":1.0,"_source":{"name":"Broccoli Cheddar Soup","ingredients":["4 tablespoons unsalted butter","1 small onion"," chopped small","1 garlic clove"," minced","1/4 cup all-purpose flour","1 cup half-and-half","4 cups low-sodium vegetable or chicken broth (here’s my favorite chicken stock)","1 bay leaf","Kosher salt and freshly ground pepper","1 1/4 pounds broccoli or 4 cups broccoli florets and stems"," chopped small","1 large carrot (about 6 ounces) or 2 slim ones"," chopped tiny (1 cup)","8 ounces (about 2 1/2 cups) coarsely grated sharp cheddar cheese"," plus a pinch extra for garnish"],"instructions":["Melt the butter in a large, heavy pot over medium heat. Add the onion and garlic and cook until tender, about 3 to 5 minutes. Stir in the flour and cook until golden, 3 to 4 minutes, then gradually whisk in the half-and-half until smooth. Add the chicken broth, bay leaf, salt and pepper and bring to a simmer. Reduce the heat to medium-low and cook, uncovered, stirring occasionally, until slightly thickened, about 10 minutes.","","Add the broccoli and carrot to the broth mixture and simmer until tender, about 15 to 20 minutes. Discard the bay leaf and adjust seasoning if needed, but err on the cautious side with the salt because the cheese will add a bit. Puree the soup to your desired texture — I like mine fairly chunky, just lightly blended — with an immersion blender or in an upright one. Back on the stove, add cheese and whisk until melted, about 1 minute."],"tags":["soup","cheesy"]}},{"_index":"recipes","_type":"recipes","_id":"sgZnPWMBIdwOg9CN2gfD","_score":1.0,"_source":{"name":"Vegan Sticky Buns","ingredients":["DOUGH","","1 cup Unsweetened Original Almond Breeze almond milk","3 Tbsp vegan butter","1 packet rapid-rise (instant) yeast (~ 2 1/4 tsp)","1 Tbsp sugar","1/4 tsp salt","2 1/2 - 3 cups unbleached all-purpose flour (I mixed all-purpose and whole-wheat pastry 2:1)","","FILLING","","1/4 cup vegan butter"," melted","1/2 cup brown sugar OR granulated sugar","1/2 Tbsp cinnamon","","STICKY GLAZE","","1/2 cup brown sugar","1/2 cup vegan butter","1/2 cup pecans"," chopped"],"instructions":["In a large sauce pan (or in a bowl in the microwave at 30 sec increments), heat the almond milk and 3 Tbsp Earth Balance until warm and melted, never reaching boiling. Remove from heat and let cool to 110 degrees (43C), or the temperature of bath water. It should be warm but not too hot or it will kill the yeast.","","Transfer mixture to a large mixing bowl and sprinkle on yeast. Let activate for 10 minutes, then add 1 Tbsp sugar and the salt and stir.","","Next add in flour 1/2 cup at a time, stirring as you go. The dough will be sticky. When it is too thick to stir, transfer to a lightly floured surface and knead for a minute or so until it forms a loose ball, adding more flour as you go and as it will absorb. Rinse your mixing bowl out, coat it with canola or grape seed oil, and add your dough ball back in. Roll around to coat all sides. Cover with plastic wrap and set in a warm place to rise for about 1 hour, or until doubled in size.","","While dough is rising, prepare sticky glaze by mixing butter and brown sugar and spreading it in an even layer on the bottom of an 8x8 baking dish. Top with pecans and set aside.","","On a lightly floured surface, roll out the dough into a thin rectangle. Brush with 1/4 cup melted vegan butter and top with 1/2 cup brown sugar (or granulated sugar) and 1/2 - 1Tbsp cinnamon.","","Starting at one end, tightly roll up the dough and situate seam side down. Then with a serrated knife or a string of floss, cut the dough into 1.5 - 2 inch sections and position in your 8x8 dish with the glaze layer on the bottom (you should have about 10 rolls). Cover with plastic wrap and set on top of the oven to let it briefly rise again while you preheat oven to 350 degrees (176 C).","","Once the oven is hot, bake rolls for 25-30 minutes or until slightly golden brown. Let cool for a few minutes, carefully invert, and then serve immediately."],"tags":"justin treats"}},{"_index":"recipes","_type":"recipes","_id":"cheddar biscuits 2018-07-29","_score":1.0,"_source":{"name":"cheddar biscuits","ingredients":["","Ingredients:","","2 cups all-purpose flour","1 tablespoon sugar","1 tablespoon baking powder","2 teaspoons garlic powder","1/2 teaspoon kosher salt","1/4 teaspoon cayenne pepper, optional","1 cup buttermilk","1/2 cup unsalted butter, melted","1 1/2 cups shredded sharp cheddar cheese","","For the topping","","3 tablespoons unsalted butter, melted","1 tablespoon chopped fresh parsley leaves","1/2 teaspoon garlic powder",""],"instructions":["","1.    Preheat oven to 450 degrees F. Line a baking sheet with parchment paper or a silicone baking mat; set aside.","2.   In a large bowl, combine flour, sugar, baking powder, garlic powder, salt and cayenne pepper, if using.","3.   In a large glass measuring cup or another bowl, whisk together buttermilk and butter. Pour mixture over dry ingredients and stir using a rubber spatula just until moist. Gently fold in cheese.","4.   Using a 1/4-cup measuring cup, scoop the batter evenly onto the prepared baking sheet. Place into oven and bake for 10-12 minutes, or until golden brown.","5.   For the topping, whisk together butter, parsley and garlic powder in a small bowl. Working one at a time, brush the tops of the biscuits with the butter mixture.","",""],"tags":"cheesy","date_added":"2018-07-29"}},{"_index":"recipes","_type":"recipes","_id":"jAZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"ceasar salad dressing","ingredients":["2 small garlic cloves"," minced","1 teaspoon anchovy paste (found near the tuna fish in the supermarket)","2 tablespoons freshly squeezed lemon juice"," from one lemon","1 teaspoon dijon mustard (i like the brand maille)","1 teaspoon worcestershire sauce","1 cup mayonnaise"," best quality such as hellmann's real","1/2 cup freshly grated parmigiano-reggiano","1/4 teaspoon salt","1/4 teaspoon freshly ground black pepper"],"instructions":"in a medium bowl, whisk together the garlic, anchovy paste, lemon juice, dijon mustard and worcestershire sauce. add the mayonnaise, parmigiano-reggiano, salt and pepper and whisk until well combined. taste and adjust to your liking. the dressing will keep well in the fridge for about a week.","tags":"summer"}},{"_index":"recipes","_type":"recipes","_id":"lAZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Bavarian Leek and Cabbage Soup","ingredients":["3 tablespoons extra-virgin olive oil","2 medium leeks"," white and light green parts"," halved and thinly sliced (see Tip)","1 cup coarsely chopped carrot","1 cup diced celery","2 tablespoons chopped fresh thyme","6 cups low-sodium chicken broth or stock (or see Slow-Cooker Stock recipe"," below)","1 12-ounce bottle lager","8 cups thinly sliced green cabbage","3 cups diced red potatoes","2 bay leaves","4 cups chopped greens"," such as chard or kale","12 ounces smoked bratwurst or kielbasa"," cut into ½-inch rounds","¾ teaspoon salt","Chopped fresh parsley for garnish","Ground pepper to taste","½ cup reduced-fat sour cream"],"instructions":["Heat oil in a large pot over medium heat. Add leeks, carrot, celery and thyme. Cover and cook, stirring occasionally, for 10 minutes. Add broth (or stock), lager, cabbage, potatoes and bay leaves; cover and bring to a boil. Uncover, reduce heat and simmer for 10 minutes. Stir in greens and sausage and cook, stirring occasionally, until the potatoes are tender, 10 to 15 minutes more. Season with salt and pepper. Discard bay leaves. Ladle into bowls and top each with 1 tablespoon sour cream and parsley, if desired.","","Clean leeks well to be sure they're grit-free: After slicing, place in a bowl of water and swish around to release any sand or soil trapped between the layers. Scoop the leeks out of the bowl with a slotted spoon, leaving any dirt behind. Drain well. Repeat as needed.","Slow-Cooker Chicken Stock: Cut 1 medium carrot, 1 celery stalk and 1 small onion into 1-inch pieces. Combine with 4 pounds skinless chicken leg quarters, 6 sprigs fresh parsley, 2 sprigs fresh thyme, 1 bay leaf, 1 crushed garlic clove and 20 whole peppercorns in a 6-quart slow cooker. Add 9 cups water. Cook on High for 4 hours. Strain and let cool to room temperature before refrigerating airtight for up to 1 week or freezing for up to 3 months. Makes: about 10 cups. After straining, this stock has negligible calories, nutrients and sodium."],"tags":"winter"}},{"_index":"recipes","_type":"recipes","_id":"oAZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Ratatouille","ingredients":["","5 tablespoons extra-virgin olive oil"," divided","1 large onion"," coarsely chopped","1 medium red bell pepper"," chopped","4 cloves garlic"," minced","1 small eggplant"," cut into ½-inch chunks","½ teaspoon kosher salt"," divided","2 medium zucchini"," halved lengthwise and sliced","1 (15 ounce) can no-salt-added white beans"," rinsed","","1 pint cherry or grape tomatoes"," halved","¼ cup slivered sun-dried tomatoes","1 teaspoon Italian seasoning","1 tablespoon capers"," rinsed and chopped","½ teaspoon ground pepper","1 16- to 18-ounce tube prepared polenta (see Tip)"," sliced into 8 rounds","¼ cup toasted pine nuts"],"instructions":"Heat 1 tablespoon oil in a large pot over medium heat. Add onion and bell peppers, sprinkle with ⅛ teaspoon salt; cook, stirring occasionally, until the vegetables soften, 5 to 7 minutes. Add garlic and; cook, stirring, until fragrant, about 1 minute more. Transfer the vegetables to a large bowl. Add 1 tablespoon oil to the pot. Add eggplant, sprinkle with ¼ teaspoon salt and cook, stirring frequently, until browned in places, 4 to 6 minutes. Transfer to the bowl with the vegetables. Add another 2 tablespoons oil to the pot. Add zucchini, sprinkle with the remaining ⅛ teaspoon salt and cook, stirring frequently, until browned in places, 3 to 5 minutes. Add beans, cherry (or grape) tomatoes, sun-dried tomatoes, Italian seasoning, pepper and the reserved vegetables; stir to combine. Reduce heat to medium-low, cover and cook, stirring occasionally, until the vegetables are tender, 8 to 10 minutes. Meanwhile, heat remaining 1 tablespoon oil in a large nonstick skillet over medium heat. Add polenta rounds and cook until golden brown on the bottom, about 5 minutes. Turn each slice and cook until browned on the second side, about 5 minutes more. Stir capers into the ratatouille. Serve the polenta and the ratatouille topped with pine nuts.","tags":"summer"}},{"_index":"recipes","_type":"recipes","_id":"qAZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Slow-Baked Beans With Kale ","ingredients":["","1 bunch kale"," stemmed and washed in two changes of water","3 tablespoons extra virgin olive oil","1 medium onion"," chopped","1 carrot"," chopped","1 rib celery"," chopped","4 garlic cloves"," minced","1 ⅔ cups white beans (3/4 pound) or dried lima beans"," picked over and soaked for at least four hours and drained","1 6-ounce can tomato paste"," dissolved in 1 cup water","3 cups additional water","A bouquet garni consisting of 4 parsley sprigs"," 2 thyme sprigs and a bay leaf","1 teaspoon herbes de Provence","Salt","a generous amount of freshly ground pepper","½ cup bread crumbs"],"instructions":["","","Preheat the oven to 225 degrees. Meanwhile, bring a large pot of water to a boil, salt generously and add the kale. Blanch for two minutes, then transfer to a bowl of ice water. Drain, squeeze out water and cut into ribbons. Set aside. (I blanch the kale to extract some of the bitterness, but you can skip this step if you wish).","Heat 2 tablespoons of the olive oil over medium heat in a large ovenproof casserole. Add the onion, carrots and celery. Cook, stirring often, until the onion is tender, about five minutes. Add the garlic and cook, stirring, until fragrant, 30 seconds to a minute. Add the dissolved tomato paste, and bring to a simmer.","Add the drained beans, the remaining water, the bouquet garni, herbes de Provence and salt and pepper.. Stir in the kale, bring to a simmer, cover and place in the oven. Bake three hours until the beans are tender and creamy. Taste and adjust salt.","Mix together the remaining olive oil and the bread crumbs. Sprinkle the bread crumbs over the beans, and continue to bake another 30 minutes to an hour until the bread crumbs are lightly browned. Remove from the heat and serve; or allow to cool slightly and serve."],"tags":"casseroles"}},{"_index":"recipes","_type":"recipes","_id":"qgZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Creamy Macaroni and Cheese ","ingredients":["","2 tablespoons butter","1 cup cottage cheese (not lowfat)","2 cups milk (not skim)","1 teaspoon dry mustard","Pinch cayenne","Pinch freshly grated nutmeg","½ teaspoon salt","¼ teaspoon freshly ground black pepper","1 pound sharp or extra-sharp cheddar cheese"," grated","½ pound elbow pasta"," uncooked."],"instructions":["","Heat oven to 375 degrees and position an oven rack in upper third of oven. Use 1 tablespoon butter to butter a 9-inch round or square baking pan.","In a blender, purée cottage cheese, milk, mustard, cayenne, nutmeg and salt and pepper together. Reserve ¼ cup grated cheese for topping. In a large bowl, combine remaining grated cheese, milk mixture and uncooked pasta. Pour into prepared pan, cover tightly with foil and bake 30 minutes.","Uncover pan, stir gently, sprinkle with reserved cheese and dot with remaining tablespoon butter. Bake, uncovered, 30 minutes more, until browned. Let cool at least 15 minutes before serving."],"tags":"cheesy"}},{"_index":"recipes","_type":"recipes","_id":"rQZnPWMBIdwOg9CN2gfD","_score":1.0,"_source":{"name":"Greek Dressing","ingredients":["2 tablespoons. red wine vinegar.","2 tablespoons. freshly squeezed lemon juice (from 1/2 medium lemon)","1 clove. garlic"," minced.","1/2 teaspoon. dried oregano.","1/2 teaspoon. kosher salt.","1/4 teaspoon. freshly ground black pepper.","1/2 cup. olive oil.","1 ounce. Greek sheep's milk feta cheese"," crumbled (optional)"],"instructions":"Mix","tags":"dressing"}},{"_index":"recipes","_type":"recipes","_id":"1-Pot Chickpea Shakshuka  2018-07-22","_score":1.0,"_source":{"name":"1-Pot Chickpea Shakshuka ","ingredients":["","SHAKSHUKA","","1 Tbsp olive or avocado oil","1/2 cup diced white onion or shallot","1/2 medium red bell pepper (chopped)","3 cloves garlic, minced (3 cloves yield ~1 1/2 Tbsp)","1 28-ounce can tomato puree OR diced tomatoes with salt","3 Tbsp tomato paste","1 Tbsp coconut sugar or maple syrup (or stevia to taste)","Sea salt to taste","2 tsp smoked or sweet paprika","1 tsp ground cumin","2 tsp chili powder","1/4 tsp ground cinnamon","1 pinch cayenne pepper (optional)","1 pinch each cardamom and coriander (optional)","1 1/2 15-ounce cans cooked chickpeas (rinsed and drained)","4-5 whole kalamata or green olives (optional // pitted and halved)","1 tablespoon tahini (as per different recipe)"],"instructions":["nstructions","","Heat a large rimmed metal or cast iron skillet over medium heat. Once hot, add olive oil, onion, bell pepper and garlic. Sauté for 4-5 minutes, stirring frequently, until soft and fragrant.","Add tomato puree or diced tomatoes, tomato paste, coconut sugar, sea salt, paprika, cumin, chili powder, cinnamon, cayenne pepper (optional), cardamom, and coriander (optional). Stir to combine.","Bring to a simmer over medium heat and cook for 2-3 minutes, stirring frequently. If you're OK with a chunkier texture, leave as is. Or, scoop 3/4 of the sauce in the blender and blend until smooth for a creamier result!","Add chickpeas and olives (optional). Stir to combine. Then reduce heat to medium-low and simmer for 15-20 minutes to allow the flavors to develop and marry with the beans.","Taste and adjust seasonings as needed, adding more cumin or paprika for smokiness, cayenne for heat, coconut sugar for sweetness, cardamom and coriander for earthiness (or slight curry flavor), or chili powder for smoke/heat.","Serve as is or with bread, pasta, or rice. I loved this alongside a kale salad, and it went especially well over gluten-free pasta! Garnish with fresh lemon juice, additional olives, and cilantro or parsley for extra flavor (optional).","Store leftovers covered in the refrigerator up to 4 days or in the freezer up to 1 month. Reheat on the stovetop until completely warmed through.",""],"tags":"moroccan","date_added":"2018-07-22"}},{"_index":"recipes","_type":"recipes","_id":"iAZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"granola","ingredients":["nonstick vegetable oil spray","6 large medjool dates"," pitted"," chopped","1 cup pure maple syrup","2 tablespoons unsalted butter or virgin coconut oil","2 cups old-fashioned oats","1/2 cup raw almonds"," hazelnuts"," pecans"," walnuts"," or cashews","1/2 cup shelled pumpkin seeds (pepitas)","1/2 cup shelled sunflower seeds","2 tablespoons amaranth","1/2 teaspoon kosher salt"],"instructions":"preheat oven to 350°f. lightly coat an 8 1/2x4\" loaf pan with nonstick spray and line with parchment paper, leaving an overhang on long sides; spray parchment.,bring dates and maple syrup to a boil in a small saucepan, reduce heat to medium-high, and boil, stirring often, until dates are very soft and maple syrup is slightly reduced, 8–10 minutes. remove date mixture from heat and stir in butter until it is melted. mash dates with a potato masher or fork until as smooth as possible. (if you have an immersion blender, it will work, too). you should have about 1 cup.,toss oats, almonds, pumpkin seeds, sunflower seeds, amaranth, and salt in a large bowl. mix in date mixture until evenly coated. scrape half of oat mixture into prepared pan and press very firmly and evenly with a rubber spatula to compress it as much as possible. add remaining oat mixture and press until very tightly packed into pan.,bake, tenting with foil if browning too quickly, until loaf is darkened in color and firm around the edges, and center gives just slightly when pressed, 45–50 minutes. transfer pan to a wire rack and let loaf cool in pan before turning out (it can even sit overnight). cut into 1/2\"-thick slices with a serrated knife.,for crisp bars, lay slices on a baking sheet and bake at 350°f until golden brown, 8–10 minutes, or toast as desired in a toaster oven.","tags":"breakfast"}},{"_index":"recipes","_type":"recipes","_id":"jgZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"butternut squash coconut curry","ingredients":["2 tablespoons olive oil","½ yellow onion"," diced","3 cloves garlic"," minced","1 tablespoon curry powder","½ teaspoon coriander","½ teaspoon turmeric","¼ teaspoon cinnamon","¼ teaspoon ground ginger","⅛ teaspoon cayenne pepper","2 teaspoons sea salt or to taste","2 15-ounce cans light coconut milk","1 medium butternut squash"," peeled and cut into 1-inch cubes","2 plum tomatoes"," cut into 16ths","⅓ cup chopped cilantro","4-6 cups cooked brown rice or quinoa"," for serving"],"instructions":["heat olive oil in dutch oven or stock pot over medium-low heat. add in the onion and garlic and cook until tender (approximately 5 minutes).","add the curry powder, coriander, turmeric, cinnamon, ginger, cayenne pepper, and salt to the pot.","pour in the coconut milk and whisk to distribute the spices.","add in the butternut squash and tomatoes and simmer on low for 20-25 minutes or until the butternut squash is fork-tender.","stir in the chopped cilantro with about 5 minutes left of simmering time.","to increase the thickness, i recommend transferring two ladles of the mixture to a blender, blending for 10-15 seconds and returning the blended mixture to the pot.","ladle the mixture over heaps of brown rice and serve."],"tags":"fall"}},{"_index":"recipes","_type":"recipes","_id":"lgZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"black rice risotto","ingredients":["6 cups low-sodium veggie broth","1 tablespoon extra-virgin olive oil","1 medium onion"," finely diced","1 1/2 cups black rice","1/2 cup dry white wine","kosher salt and freshly ground pepper","3/4 cup grated parmesan cheese","1/4 cup fresh basil leaves"," thinly sliced","read more at: http://www.foodnetwork.com/recipes/ellie-krieger/black-rice-risotto-recipe.html?oc=linkback"],"instructions":["bring the broth to a simmer in a saucepan over medium-high heat; cover and keep warm.","meanwhile, heat the olive oil in a large saucepan over medium heat. add the onion and cook until soft, about 4 minutes. add the rice and cook, stirring, 1 minute. reduce the heat to medium low. stir in the wine until the liquid is absorbed, about 3 minutes.","ladle in 3/4 cup hot broth and cook, stirring constantly, until the liquid is absorbed, 6 to 7 minutes. repeat with the remaining broth, adding 3/4 cup at a time, until the rice is tender but somewhat chewy, about 50 minutes.","stir in 3/4 teaspoon salt, pepper to taste and 1/2 cup parmesan. divide among bowls. top with the remaining 1/4 cup parmesan and the basil.","read more at: http://www.foodnetwork.com/recipes/ellie-krieger/black-rice-risotto-recipe.html?oc=linkback"],"tags":"fall"}},{"_index":"recipes","_type":"recipes","_id":"mgZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"sweet potato white bean risotto","ingredients":["2 medium sweet potatoes"," peeled and diced","","1 tablespoon fresh sage plus more for garnish"," minced","","1/2 medium onion"," diced","","3/4 cup dry white wine","","1 cup arborio rice","","4 cups vegetable broth","","1 can white beans"," drained and rinsed","","1 cup lacinato kale"," finely shredded","","Salt and pepper to taste"],"instructions":["1. Preheat oven to 400 degrees. Sprinkle sweet potatoes with water and toss with 1 tablespoon fresh sage and salt to taste. Roast for about 40 minutes, stirring occasionally, until sweet potatoes are tended.","","2. While potatoes are roasting, begin cooking the risotto. Heat 2 tablespoons water in a medium sized sauce pan over medium heat. Add onion, season with salt, and cook for 5 to 10 minutes, stirring frequently, until onion is tender. Add splash of water as necessary to prevent sticking.","","2.     Add rice and cook, stirring constantly, for 30 to 60 seconds to lightly toast the rice.","","3.     Add wine and cook, stirring frequently, until the liquid is absorbed, approximately 5 minutes.","","4.     Add the broth, ½ cup to 1 cup at a time, stirring each addition frequently until the liquid is absorbed, approximately 5 minutes per addition. Continue adding broth until rice has expanded and is tender.","","5.     Off heat, stir in roasted sweet potatoes, white beans and kale. Season with salt and pepper to taste and garnish with fresh sage, if desired."],"tags":["summer","fall"]}},{"_index":"recipes","_type":"recipes","_id":"qwZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Beet, Greens and Cheddar Crumble ","ingredients":["","1 pound medium beets","3 sprigs fresh thyme branches plus 3/4 teaspoon fresh thyme leaves","2 garlic cloves"," peeled","¼ teaspoon black peppercorns","Kosher salt and black pepper","1 ¼ pounds beet greens"," Swiss chard or a mix of both","11 tablespoons cold unsalted butter"," more for greasing pan","150 grams all-purpose flour (1 1/3 cups)","2 cups milk","9 ounces sharp Cheddar"," grated (2 1/4 cups)","2 to 3 tablespoons English mustard powder"," to taste","1 teaspoon Worcestershire sauce","½ teaspoon Tabasco sauce"," more as needed","25 grams rolled oats (1/4 cup)","20 grams toasted hazelnuts"," chopped (3 tablespoons)","1 ½ teaspoons grated Parmigiano-Reggiano","¼ teaspoon freshly grated nutmeg"],"instructions":["","Combine beets, thyme branches, garlic and peppercorns in a large pot. Cover with cold salted water. Bring to a simmer over medium-high heat; cook until beets are tender, 15 to 30 minutes depending on size. Remove with a slotted spoon. Add greens and cook for 2 minutes (do this in batches if necessary); remove with tongs and transfer immediately to a bowl of ice water. Drain well.","Once beets are cool enough to handle, peel them and slice crosswise into 1/4-inch-thick slices. Roughly chop greens’ leaves and stalks.","Prepare the béchamel: In a small saucepan over low heat, melt 5 tablespoons butter. Stir in 75 grams flour ( 2/3 cup). Cook, stirring constantly, for 2 minutes; roux should smell cooked but remain white. Slowly whisk in milk until mixture forms a thick, smooth sauce. Stir in 8 ounces Cheddar (2 cups) until melted. Stir in mustard powder, Worcestershire and Tabasco. Season with salt to taste.","Make the crumble topping: In a small bowl, stir together remaining 2/3 cup flour, the oats and the hazelnuts. Use your fingers to work in 6 tablespoons butter, the remaining 1 ounce Cheddar ( 1/4 cup) and the Parmigiano-Reggiano. It should be a mixture of large and small pieces. Season with a pinch of salt, pepper and the nutmeg.","When you are ready to assemble the dish, heat oven to 350 degrees. Butter a 2-quart gratin or baking dish. Spread a layer of béchamel on the bottom. Top with a layer of beets, followed by a layer of greens and stalks. Season generously with salt and pepper, and sprinkle with thyme leaves. Spread another layer of béchamel on top and repeat process to fill dish (you will end up with 3 or 4 layers). Cover entire surface with crumble topping. Transfer dish to oven and bake until bubbling and golden brown in spots, 45 minutes to 1 hour."],"tags":"casseroles"}},{"_index":"recipes","_type":"recipes","_id":"Sesame Green Bean 2018-05-13","_score":1.0,"_source":{"name":"Sesame Green Bean","ingredients":[["1 pound green beans"],["1/2 teaspoon toasted sesame oil"],["2 teaspoons rice vinegar"],["1 teaspoon sesame seeds"],["salt"],["pepper"]],"instructions":[["1. Blanch or steam green beans"],["2. Whisk together vinegar, oil, salt and pepper"],["3. Mix green beans and vinegar oil mixture"]],"tags":["justin friendly","East Asian"],"date_added":"2018-05-13"}},{"_index":"recipes","_type":"recipes","_id":"crispy sesame tofu 2018-05-13","_score":1.0,"_source":{"name":"crispy sesame tofu","ingredients":[["1 pound block firm tofu"],["2 tablespoons toasted sesame oil"],["1/4 cup sesame seeds"],["1 head broccoli"],["3 tablespoons soy sauce"],["salt and pepper"]],"instructions":[["1. drain tofu"],["2. spread sesame seeds on a plate. Press both sides of each tofu square into sesame seeds."],["3. In large non-stick skillet, heat 1 tablespoon sesame oil over medium heat and cook tofu appro 4-6 minutes on each side. Add soy sauce and continue cooking, turning tofu until it has absorbed all the liquid."],["4. Cook broccoli in same pan."]],"tags":["East Asian","justin friendly"],"date_added":"2018-05-13"}},{"_index":"recipes","_type":"recipes","_id":"Marinated Baked Tofu 2018-05-19","_score":1.0,"_source":{"name":"Marinated Baked Tofu","ingredients":["1 pound extra-firm tofu","2 tablespoons low-sodium soy sauce","1 tablespoon orange juice","2 teaspoons sesame oil","1 teaspoon canola oil","Cooking spray"],"instructions":["1. Slice the tofu into 1/2-inch-thick slabs and lay the slices on top of paper towels. Use more paper towels (you'll probably need three) and firmly pat the tofu in order to remove as much of the water as possible. Cut the tofu into 3/4-inch cubes.","","2. In a medium bowl, combine the soy sauce, orange juice, sesame oil, and canola oil. Add the tofu cubes and toss gently. Cover and let the tofu marinate in the refrigerator for at least 30 minutes, and up to 24 hours.","","3. Preheat the oven to 450°F. Spray a large shallow baking dish with cooking spray. Place the tofu in a single layer in the baking dish. Bake for 25 to 30 minutes, or until golden brown."],"tags":"justin friendly","date_added":"2018-05-19"}},{"_index":"recipes","_type":"recipes","_id":"swiss mushroom loaf 2018-09-23","_score":1.0,"_source":{"name":"swiss mushroom loaf","ingredients":["","1 loaf (1 pound) Italian bread, unsliced","1 block (8 ounces) Swiss cheese, cut into cubes","1 cup sliced fresh mushrooms","1/4 cup softened butter, cubed","1 small onion, finely chopped","1-1/2 teaspoons poppy seeds","2 garlic cloves, minced","1/2 teaspoon seasoned salt","1/2 teaspoon ground mustard","1/2 teaspoon lemon juice"],"instructions":["","Preheat oven to 350°. Cut bread diagonally into 1-in. slices to within 1 in. of bottom of loaf. Repeat cuts in opposite direction. Place cheese cubes and mushrooms in cuts.","In a microwave-safe bowl, combine remaining ingredients; microwave, covered, on high until butter is melted, 30-60 seconds. Stir until blended. Spoon over bread.","Wrap loaf in foil; place on a baking sheet. Bake until cheese is melted, about 40 minutes."],"tags":"cheesy","date_added":"2018-09-23"}},{"_index":"recipes","_type":"recipes","_id":"igZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"quinoa salad with black beans, corn, and tomatoes","ingredients":["1 cup uncooked quinoa"," well rinsed","1/2 teaspoon salt","2 cups water","1/3 cup diced red onion","2 tbsp lime juice","1 15-ounce can black beans"," drained and rinsed","1 cup frozen corn"," defrosted"," or 1 cup of fresh corn"," parboiled"," drained and cooled (approximately the amount of kernels from one ear of corn)","3 medium tomatoes"," seeded and cut into chunks","5 ounces queso fresco"," queso panela"," fresh mozzarella or other mild farmer's cheese"," cut into 1/4-inch to 1/2-inch cubes","1 jalapeño"," seeded and finely chopped","1/4 cup chopped cilantro"," including tender stems"," packed","3 tbsp olive oil"],"instructions":["1 put the rinsed quinoa, salt and water into a pot and bring it to a boil. cover and simmer gently until the quinoa absorbs all the water, about 10-15 minutes. remove from heat and let sit for 5 minutes. place into a large bowl and fluff up with a fork to help it cool more quickly.","2 while the quinoa is cooking, prepare the rest of the salad. soak the red onions in the lime juice and set aside. soaking the onions in lime juice (or lemon juice or water) helps take the edge off of them. mix the prepped black beans, corn kernels, tomatoes, cheese, jalapenos, cilantro, and oil into a large bowl.","3 when the quinoa has cooled, mix it into the bean mixture. add the red onion and the lime juice and add salt, more oil or lime juice to taste. serve at room temperature."],"tags":"fall"}},{"_index":"recipes","_type":"recipes","_id":"jwZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Christina tickles","ingredients":"One joke about her height","instructions":["Make a joke about Christina's height.","Wait half a second.","Makes enough tickles for several minutes"],"tags":"Christina friendly"}},{"_index":"recipes","_type":"recipes","_id":"kgZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Green Bean Sweet Potato Casserole","ingredients":["1 head cauliflower (1 1/2 to 2 lb.)"," cut into small florets","1 (8-oz.) package fresh cremini mushrooms"," stemmed and halved","6 tablespoons olive oil"," divided","1 teaspoon ground cumin"," divided","1 teaspoon kosher salt"," divided","1/4 teaspoon freshly ground black pepper"," divided","3 large sweet potatoes (2 1/2 to 3 lb.)"," peeled and cut into 1/4-inch-thick slices","2 garlic cloves"," minced","4 cups chopped fresh kale"," collards"," or mustard greens","2 teaspoons red wine vinegar","1 (14-oz.) can butter beans"," drained and rinsed (optional)","Easy Cheese Sauce","1/2 cup panko (Japanese breadcrumbs)","1 tablespoon chopped cilantro","1 teaspoon extra virgin olive oil"],"instructions":["Preparation","","1. Preheat oven to 475°. Toss together cauliflower, mushrooms, 2 1/2 Tbsp. oil, 1/2 tsp. cumin, 1/2 tsp. salt, and 1/8 tsp. pepper in a medium bowl. Spread cauliflower mixture in a single layer in jelly-roll pan.","","2. Toss together sweet potatoes, 2 1/2 Tbsp. oil, and remaining cumin, salt, and pepper. Spread in a single layer in another jelly-roll pan.","","3. Bake potatoes and cauliflower at 475° for 10 to 12 minutes or until browned and just tender, turning once. Cool on wire racks 10 minutes.","","4. Reduce oven temperature to 375°. Heat remaining 1 Tbsp. oil in a large skillet over medium-high heat. Add garlic; cook, stirring often, 1 minute. Add kale; cook, stirring occasionally, 10 minutes or until tender. Add salt and pepper to taste; stir in vinegar.","","5. Layer half each of sweet potatoes, cauliflower mixture, beans (if desired), kale, and 1 1/2 cups Easy Cheese Sauce in a lightly greased 13- x 9-inch baking dish. Repeat layers once. Top with remaining 1/2 cup cheese sauce. Stir together panko, chopped cilantro, and olive oil, and sprinkle crumb mixture over casserole.","","6. Bake at 375° for 20 to 25 minutes or until thoroughly heated, bubbly, and golden brown. Let stand 5 minutes before serving."],"tags":"Christina friendly"}},{"_index":"recipes","_type":"recipes","_id":"kwZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Bavarian Leek and Cabbage Soup","ingredients":["3 tablespoons extra-virgin olive oil","2 medium leeks"," white and light green parts"," halved and thinly sliced (see Tip)","1 cup coarsely chopped carrot","1 cup diced celery","2 tablespoons chopped fresh thyme","6 cups low-sodium chicken broth or stock (or see Slow-Cooker Stock recipe"," below)","1 12-ounce bottle lager","8 cups thinly sliced green cabbage","","3 cups diced red potatoes","2 bay leaves","4 cups chopped greens"," such as chard or kale","12 ounces smoked bratwurst or kielbasa"," cut into ½-inch rounds","¾ teaspoon salt","Chopped fresh parsley for garnish","Ground pepper to taste","½ cup reduced-fat sour cream"],"instructions":["Heat oil in a large pot over medium heat. Add leeks, carrot, celery and thyme. Cover and cook, stirring occasionally, for 10 minutes. Add broth (or stock), lager, cabbage, potatoes and bay leaves; cover and bring to a boil. Uncover, reduce heat and simmer for 10 minutes. Stir in greens and sausage and cook, stirring occasionally, until the potatoes are tender, 10 to 15 minutes more. Season with salt and pepper. Discard bay leaves. Ladle into bowls and top each with 1 tablespoon sour cream and parsley, if desired.","","Clean leeks well to be sure they're grit-free: After slicing, place in a bowl of water and swish around to release any sand or soil trapped between the layers. Scoop the leeks out of the bowl with a slotted spoon, leaving any dirt behind. Drain well. Repeat as needed.","Slow-Cooker Chicken Stock: Cut 1 medium carrot, 1 celery stalk and 1 small onion into 1-inch pieces. Combine with 4 pounds skinless chicken leg quarters, 6 sprigs fresh parsley, 2 sprigs fresh thyme, 1 bay leaf, 1 crushed garlic clove and 20 whole peppercorns in a 6-quart slow cooker. Add 9 cups water. Cook on High for 4 hours. Strain and let cool to room temperature before refrigerating airtight for up to 1 week or freezing for up to 3 months. Makes: about 10 cups. After straining, this stock has negligible calories, nutrients and sodium."],"tags":"winter"}},{"_index":"recipes","_type":"recipes","_id":"mAZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Fried potato, peppers and eggplant","ingredients":["185 ml extra virgin olive oil","2 medium potatoes"," peeled and cut into 5 mm wedges","1 small eggplant","2 medium red capsicums (preferably corno di toro – bull’s horn)"," cut into 2 cm strips","2 garlic cloves"," chopped","1 medium tomato"," thinly sliced","6 basil leaves"],"instructions":["Heat the oil in a large frying pan over medium heat and add the potatoes. Fry until lightly golden, then remove from the oil and place on a warm plate. Keep warm.","","Peel and finely slice the eggplant (it is best to do this just before cooking so it doesn’t go brown) and add to the pan along with the capsicum. Stir-fry over medium heat until just soft, then return the potatoes to the pan and stir everything together.","","Move the ingredients to the edges of the pan to create a gap in the middle. Add the garlic to the gap and fry for 5 seconds until it releases its aroma, then add the tomato, basil and salt to taste and stir for 10 seconds. Serve with crusty bread."],"tags":"mediterranean"}},{"_index":"recipes","_type":"recipes","_id":"mwZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Eggplant, Potato, Pepper Casserole","ingredients":["2 1 1/4-pound eggplants"," thinly sliced crosswise","1 1/2 tablespoons olive oil","1 large onion"," chopped","5 large garlic cloves"," chopped","1 28-ounce can Italian-style tomatoes","2 large fresh thyme sprigs","olive oil (for frying)","3 pounds russet potatoes"," peeled"," thinly sliced","3 green bell peppers"," cored"," thinly sliced","5 tablespoons minced fresh thyme"],"instructions":["Place eggplant slices on 2 baking sheets. Lightly salt eggplant on both sides. Let stand 1 hour. Using paper towels, pat eggplant dry, wiping off salt.","","Heat 1 1/2 tablespoons oil in large skillet over medium heat. Add onion and garlic, sauté until golden, about 10 minutes. Add tomatoes with their juices and thyme sprigs; bring to boil. Reduce heat and simmer until mixture is reduced to 2 1/2 cups, breaking up tomatoes with back of spoon, about 20 minutes. Season sauce with salt and pepper. Discard thyme sprigs.","","Preheat oven to 350°F. Add oil to 2 large skillets to depth of 1/4 inch. Heat over medium-high heat. Working in batches, add eggplant to skillets and cook until golden, adding more oil to skillets as necessary, about 5 minutes per side. Transfer to paper towels and drain. Working in batches, add potatoes to skillets, cook until golden, about 3 minutes per side. Transfer potatoes to paper towels. Add green peppers to same skillet; sauté until almost tender, about 5 minutes. Transfer to paper towels.","","Layer half of eggplant in 15x10x2-inch glass baking dish. Sprinkle with 1 tablespoon thyme. Spoon 1/2 cup sauce over. Top with half of potatoes. Season with salt and pepper. Top with 1 tablespoon thyme. Spoon 1/2 cup sauce over. Place all pepper slices over. Season with salt and pepper. Top with 1 tablespoon thyme. Spoon 1/2 cup sauce over. Top with remaining eggplant. Top with 1 tablespoon thyme. Spoon 1/2 cup sauce over. Top with remaining potatoes. Season with salt and pepper. Top with 1 tablespoon thyme and 1/2 cup sauce.","","Bake uncovered until vegetables are tender, about 40 minutes. Let stand 15 minutes before serving."],"tags":"cheesy"}},{"_index":"recipes","_type":"recipes","_id":"nAZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"vegan chocolate truffles","ingredients":["","1 cup full-fat coconut milk"," stirred well","10 1/2 ounces dairy-free dark chocolate (preferably 75 percent or higher cacao)"," finely chopped","1/2 cup freeze-dried strawberries (about 1/2 ounce)","1/4 cup unsweetened"," dessicated (dried) coconut","2 tablespoons chopped pecans or nut of your choice","1 tablespoon unsweetened cocoa powder","1 tablespoon chipotle powder"],"instructions":["","","Heat the coconut milk in a small pan over low heat until it's just starting to bubble.","","Place the chocolate in a medium heatproof bowl. Immediately pour the warm coconut milk over it, whisking to form a smooth ganache. Cover the bowl with plastic wrap and refrigerate until set, 1 to 2 hours.","","Grind the dried strawberries to a fine powder in a mini food processor or clean spice grinder, then transfer the powder to a small bowl. Place the coconut, pecans, cocoa powder and chipotle powder in separate small bowls.","","Once the truffle mixture has set, uncover it. Grease your hands with cooking oil spray and use a tablespoon-size scoop or #100 disher to scoop out a ball, then roll it lightly between your palms. Place on a tray, and repeat to create balls using the remaining truffle mixture. (Your palms will become covered in chocolate as you work, and the balls will soften on the outside, but that's okay.)","","Use a fork to help lift and toss the truffles. Roll some of them in strawberry powder, some in coconut, some in pecans, some in cocoa powder, some in chipotle powder (for those who don't mind something fiery) or in a mix of chipotle and cocoa (for a kick that's a little milder) until well coated. You may need to use your fingers to press in the coconut and the pecans. Set each one into a paper candy cup as you finish.","","When all the truffles are made, pack them into an airtight container (being careful not to stack them) and refrigerate until ready to serve -- or give."],"tags":"justin friendly"}},{"_index":"recipes","_type":"recipes","_id":"nQZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"black bean sauce","ingredients":["1 (15-ounce) can black beans"," undrained","1 tablespoon low-sodium soy sauce","1 teaspoon grated peeled ginger","1/2 teaspoon grated orange rind","1/8 teaspoon crushed red pepper","1 garlic clove"," minced"],"instructions":"combine all the ingredients in a medium saucepan; bring to a boil. reduce heat, and simmer, uncovered, 20 minutes.","tags":"justin friendly"}},{"_index":"recipes","_type":"recipes","_id":"nwZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Gazpacho","ingredients":["2 large"," ripe"," juicy tomatoes"," cored","1 shallot","2 Persian cucumbers"," or 1 medium Kirby cucumber"," seeded and peeled","1 stalk celery","1 red bell pepper"," stemmed and seeded","1½ cloves garlic","1½ tablespoons rice vinegar","1 tablespoon lemon juice","Salt and freshly ground black pepper","1 teaspoon Worcestershire sauce"," optional","½ cup olive oil"," plus more for drizzling","3 cups roughly torn sourdough bread without crust","2 tablespoons roughly chopped basil leaves"],"instructions":["1. Preheat oven to 350 degrees. Roughly chop tomatoes, shallot, cucumbers, celery, bell pepper and garlic, then place in a food processor. Purée until vegetables are finely minced and soupy. Pulse in vinegar and lemon juice, and season to taste with salt, pepper and Worcestershire, if using. Pulse in half the oil. Refrigerate soup until chilled, at least 10 minutes.","","2. Meanwhile, line a baking sheet with parchment paper. In a large bowl, toss sourdough pieces with enough of the remaining oil so that bread is well saturated. Season with salt, and spread on prepared baking sheet. Bake until golden brown, about 7 minutes.","","3. Ladle chilled gazpacho into bowls and garnish with croutons and basil. Drizzle with additional olive oil, season with salt and serve."],"tags":["summer","soup"]}},{"_index":"recipes","_type":"recipes","_id":"pAZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Mac and Cheese","ingredients":["","2 tablespoons butter","1 cup cottage cheese (not lowfat)","2 cups milk (not skim)","1 teaspoon dry mustard","Pinch cayenne","Pinch freshly grated nutmeg","½ teaspoon salt","¼ teaspoon freshly ground black pepper","1 pound sharp or extra-sharp cheddar cheese"," grated","½ pound elbow pasta"," uncooked."],"instructions":["","","Heat oven to 375 degrees and position an oven rack in upper third of oven. Use 1 tablespoon butter to butter a 9-inch round or square baking pan.","In a blender, purée cottage cheese, milk, mustard, cayenne, nutmeg and salt and pepper together. Reserve ¼ cup grated cheese for topping. In a large bowl, combine remaining grated cheese, milk mixture and uncooked pasta. Pour into prepared pan, cover tightly with foil and bake 30 minutes.","Uncover pan, stir gently, sprinkle with reserved cheese and dot with remaining tablespoon butter. Bake, uncovered, 30 minutes more, until browned. Let cool at least 15 minutes before serving."],"tags":"fall"}},{"_index":"recipes","_type":"recipes","_id":"pQZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"vegan brownies","ingredients":["Ingredients","","1/2 cup (1 stick) non-dairy butter (such as Earth Balance)","3/4 cup natural cane or granulated sugar","2 large flax eggs","1 tsp vanilla extract","3/4 tsp baking powder","1/4 tsp sea salt","1/2 cup dutch-process cocoa powder","3/4 cup unbleached all-purpose flour","Optional Add-Ins: 1/3 cup walnuts"," hazelnuts or chocolate chips"],"instructions":["Instructions","","Preheat oven to 350 degrees F (176 C) and spray 7-8 standard-sized muffin tins with cooking spray. Alternatively, fit each with a paper liner.","Prepare flax eggs in a small bowl and let rest for 5 minutes.","Place butter in a large mixing bowl and melt in the microwave. Then stir in the flax egg, sugar, vanilla, baking powder, salt and cocoa powder. Whisk to combine. Lastly, add the flour, then fold in any mix-ins - chocolate chips or walnuts would be excellent here.","Scoop batter evenly into 7-8 muffin tins until 3/4 full and bake on the middle rack for 22-26 minutes, or until the brownies start to pull away from the sides and they spring back slightly to the touch. Be careful not to overcook or they will get crumbly. Remove from oven and let rest in the tin for 5 minutes before removing to cool completely on a plate or cooling rack.","Store in an airtight container to keep fresh for a couple days. Freeze for long-term storage."],"tags":"justin treats"}},{"_index":"recipes","_type":"recipes","_id":"rwZnPWMBIdwOg9CN2gfD","_score":1.0,"_source":{"name":"cornbread","ingredients":["","1 cup cornmeal","1 1⁄4 cups flour","1⁄4 cup sugar","1 tablespoon baking powder","1⁄2 teaspoon baking soda","1⁄2 teaspoon salt","1 1⁄4 cups milk or 1 1⁄4 cups rice milk or 1 1⁄4 cups soymilk","1⁄2 cup olive oil or 1⁄2 cup vegetable oil","2 tablespoons white vinegar","1 tablespoon corn syrup"],"instructions":["Preheat oven to 375 degrees.","Grease an 8\" or 9\" square pan.","Combine the dry ingredients--cornmeal, flour, sugar, baking powder, baking soda, and salt.","Stir in the wet ingredients--milk, oil, vinegar, and corn syrup.","Pour batter into pan.","Bake for 20 minutes or until the sides begin to pull away from the edge of the pan and wooden toothpick inserted in center comes out clean."],"tags":"justin friendly"}},{"_index":"recipes","_type":"recipes","_id":"Pasta with Creamy Mushroom Sauce 2018-05-08","_score":1.0,"_source":{"name":"Pasta with Creamy Mushroom Sauce","ingredients":[["1 pound rigatoni pasta"],["2 tablespoons olive oil"],["2 shallots, minced"],["1 clove garlic, minced"],["Salt and freshly ground black pepper"],["1 pound assorted mushrooms, (such as cremini, shiitake and button), cleaned and sliced"],["1/2 cup white wine"],["1/2 cup vegetable stock"],["1 cup (8 ounces) mascarpone cheese, at room temperature"],["1/2 cup grated Parmesan"],["1/4 cup chopped fresh chives"]],"instructions":[["Bring a large pot of salted water to a boil over high heat. Add the pasta and cook until tender but still firm to the bite, stirring occasionally, about 8 to 10 minutes."],[""],["While the pasta is cooking:"],[""],["Heat the oil in a large skillet over medium-high heat. Add the shallots and garlic to the pan. Season with salt and pepper. Cook until soft, about 2 minutes. Add the mushrooms to the pan and season with salt and pepper. Cook until mushrooms are tender, stirring occasionally, about 5 to 7 minutes. Turn the heat to high. Add the wine and cook for 3 minutes until all the liquid evaporates. Add the stock and simmer until liquid is slightly reduced. Remove the pan from the heat. Add the mascarpone cheese. Stir until creamy. Drain the pasta, reserving about 1 cup of the pasta water, and transfer to a serving bowl. Add the mushroom mixture and the Parmesan. Season with salt and pepper, to taste. Toss well to coat pasta, adding the reserved pasta water, if needed, to loosen the pasta. Garnish with the chopped chives. Serve immediately."]],"tags":"cheesy","date_added":"2018-05-08"}},{"_index":"recipes","_type":"recipes","_id":"jQZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"kidney bean and cauliflower curry","ingredients":["3 tablespoons vegetable oil","1 large onion"," chopped","1 cinnamon stick (2-in.)","1 bay leaf","1 tablespoon minced fresh garlic","1 tablespoon ginger","1 teaspoon fennel","1 teaspoon cumin seeds","3 green cardamom pods"," cracked open","1/4 teaspoon cayenne","1/2 teaspoon ground coriander","1/2 teaspoon turmeric","1/2 teaspoon garam masala","1 can (14.5-oz.) whole peeled plum tomatoes"," without juice","1 serrano chile"," stemmed"," seeded"," and minced","about 1 tsp. salt","6 cups cooked red kidney beans (about four 14-oz. cans)"," rinsed and drained","1/2 head cauliflower"," cut into 1/2- to 1-in. florets","1 to 1 1/2 tbsp. freshly squeezed lemon juice","1/2 cup loosely packed cilantro sprigs"," coarsely chopped","6 to 8 cups hot cooked brown rice (see notes)"],"instructions":["1. heat oil in a heavy-bottomed 4- to 5-qt. pot or saucepan over medium-high heat. add onion and fry, stirring occasionally, 2 to 3 minutes, or until slightly softened. stir in cinnamon, bay leaf, garlic, ginger, fennel, cumin, and cardamom and fry, stirring, 2 minutes. add cayenne, coriander, turmeric, and garam masala and fry, stirring, 1 minute. shred tomatoes into pot with your fingers. stir in serrano chile, salt, kidney beans, cauliflower, and 1 1/2 cups water. lower heat to medium-low, cover, and simmer 20 minutes, or until cauliflower is tender and liquid has thickened into a velvety-looking sauce (add more water if necessary).","2. season beans with salt. stir in lemon juice and cilantro. serve hot over brown rice, with plain yogurt on the side if you like."],"tags":"fall"}},{"_index":"recipes","_type":"recipes","_id":"kAZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Oatmeal breakfast bars","ingredients":["2 1/2 cups old fashioned rolled oats","1 1/2 cups whole wheat pastry flour","1 tsp salt","1 tsp baking powder","1/4 cup turbinado sugar"," or brown sugar","3/4 cup almonds"," chopped","1/2 cup raisins","1/2 cup shredded unsweetened coconut","2 Tbsp ground flax seed + 2 Tbsp water","1/3 cup coconut oil","1/4 cup peanut butter","1 Tbsp apple cider vinegar","1/2 cup maple syrup","2 tsp vanilla extract"],"instructions":["Preheat your oven to 350F. Line an 8x8\" baking pan with a piece of parchment and grease with spray oil.","Mix the flax and water together in a small bowl and set aside. Combine the oats, pastry flour, salt, baking powder, and turbanido sugar in a large bowl (larger than you think you need). Add the almonds, raisins, and coconut and mix well.","Melt the coconut oil in a glass 2-cup measuring cup (or another bowl). Add the peanut butter and mix until thoroughly combined. Add in the apple cider vinegar, maple syrup, flax mixture, and vanilla and stir well.","Pour the wet ingredients over the oat mixture and mix very well until all the ingredients are moistened. I find it easiest and most effective to use my hands - just dig in.","Dump the dough into your prepared pan and spread it out evenly. Using your hands, press the dough down very firmly all round the pan. The harder you press the better the bars will stay together!","Bake the bars for about 30 minutes, rotating halfway through. They should be lightly golden on top and the sides should be just a bit crunchy. Let cool completely, then remove the whole thing from the pan and cut into 12 bars. Enjoy!"],"tags":["breakfast","justin friendly"]}},{"_index":"recipes","_type":"recipes","_id":"lQZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Bavarian Leek and Cabbage Soup","ingredients":["3 tablespoons extra-virgin olive oil","2 medium leeks"," white and light green parts"," halved and thinly sliced (see Tip)","1 cup coarsely chopped carrot","1 cup diced celery","2 tablespoons chopped fresh thyme","6 cups low-sodium chicken broth or stock (or see Slow-Cooker Stock recipe"," below)","1 12-ounce bottle lager","8 cups thinly sliced green cabbage","3 cups diced red potatoes","2 bay leaves","4 cups chopped greens"," such as chard or kale","12 ounces smoked bratwurst or kielbasa"," cut into ½-inch rounds","¾ teaspoon salt","Chopped fresh parsley for garnish","Ground pepper to taste","½ cup reduced-fat sour cream"],"instructions":["Heat oil in a large pot over medium heat. Add leeks, carrot, celery and thyme. Cover and cook, stirring occasionally, for 10 minutes. Add broth (or stock), lager, cabbage, potatoes and bay leaves; cover and bring to a boil. Uncover, reduce heat and simmer for 10 minutes. Stir in greens and sausage and cook, stirring occasionally, until the potatoes are tender, 10 to 15 minutes more. Season with salt and pepper. Discard bay leaves. Ladle into bowls and top each with 1 tablespoon sour cream and parsley, if desired.","","Clean leeks well to be sure they're grit-free: After slicing, place in a bowl of water and swish around to release any sand or soil trapped between the layers. Scoop the leeks out of the bowl with a slotted spoon, leaving any dirt behind. Drain well. Repeat as needed.","Slow-Cooker Chicken Stock: Cut 1 medium carrot, 1 celery stalk and 1 small onion into 1-inch pieces. Combine with 4 pounds skinless chicken leg quarters, 6 sprigs fresh parsley, 2 sprigs fresh thyme, 1 bay leaf, 1 crushed garlic clove and 20 whole peppercorns in a 6-quart slow cooker. Add 9 cups water. Cook on High for 4 hours. Strain and let cool to room temperature before refrigerating airtight for up to 1 week or freezing for up to 3 months. Makes: about 10 cups. After straining, this stock has negligible calories, nutrients and sodium."],"tags":"winter"}},{"_index":"recipes","_type":"recipes","_id":"mQZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Cabbage and Potato Gratin","ingredients":["large savoy or green cabbage (about 2 pounds)"," quartered","1 pound baking potatoes"," such as russets"," peeled and sliced","2 garlic cloves"," peeled","2 cups milk","½ cup crème fraîche","Ground black pepper","4 ounces Gruyère"," grated (1 cup"," tightly packed)","1 ounce Parmesan"," grated (1/4 cup)","2 teaspoons finely chopped or slivered fresh sage"],"instructions":["","Bring a large pot of water to a boil, salt generously and add quartered cabbage and potato slices. Reduce heat to medium-high and boil gently for 5 minutes.","Drain and use tongs to transfer cabbage quarters to a colander set over a bowl or in the sink. Allow cabbage to cool in colander until you can handle the wedges. Core the wedges, then cut them in half lengthwise. Finally, slice crosswise into 1/2-inch-wide ribbons. Return to colander and drain for another 5 minutes. Place in a large bowl with the potatoes.","Heat oven to 375 degrees. Butter a 3-quart baking dish or gratin. Cut one of the garlic cloves in half and rub the dish with the cut surface. Then slice up all the garlic and toss with cabbage and potatoes.","In a bowl, whisk together milk, crème fraîche, about 1 teaspoon salt and the pepper. Pour into bowl with cabbage and potatoes, add cheeses and sage, and gently toss together. Scrape into baking dish.","Bake 1 hour 15 minutes to 1 hour 30 minutes, until top is golden brown. During the first 45 minutes, press the vegetables down into the liquid in the baking dish every 10 to 15 minutes, using the back of a large spoon. The gratin will still be bubbling when you remove it from the oven, and you will see liquid in the baking dish. Wait 10 to 15 minutes before serving, until liquid is reabsorbed. If liquid remains in dish, serve with a slotted spoon."],"tags":["fall","cheesy"]}},{"_index":"recipes","_type":"recipes","_id":"oQZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Glazed Sesame Eggplant","ingredients":["Ingredients","","6 tablespoons soy sauce","2 1/2 tablespoons toasted sesame oil"," plus more for brushing","1 1/2 tablespoons brown sugar","4 small japanese eggplants","Toasted sesame seeds"," for sprinkling","Finely chopped chives"," for sprinkling"],"instructions":["Preparation","","In a small saucepan, whisk together 6 tablespoons soy sauce, 2 1/2 tablespoons toasted sesame oil and 1 1/2 tablespoons brown sugar; bring to a boil and cook until reduced by one-third. Slice 4 small japanese eggplants, alternating between crosswise and diagonal cuts to make 32 wedges about 1 inch long. Stand the eggplant wedges on a parchment-paper-lined baking sheet. Brush with toasted sesame oil and bake in a 375 degrees oven for 15 minutes. Brush with two-thirds of the soy glaze and bake for 10 minutes more, then brush with the remaining soy glaze. Sprinkle with toasted sesame seeds and finely chopped chives. Serve warm."],"tags":["justin friendly","East Asian"]}},{"_index":"recipes","_type":"recipes","_id":"ogZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Portobello Marinade","ingredients":["1 cup olive oil","1/2 cup balsamic vinegar","1/2 cup reduced-sodium soy sauce","2 garlic cloves"," pressed","1/4 teaspoon coarse kosher salt","1/4 teaspoon freshly ground black pepper","1/4 cup Marsala (optional)","4 large fresh thyme sprigs","6 large portobello mushrooms"],"instructions":"Mix and marinade","tags":"dressing"}},{"_index":"recipes","_type":"recipes","_id":"pwZnPWMBIdwOg9CN2gfC","_score":1.0,"_source":{"name":"Honey Dijon Vinaigrette","ingredients":["1/4 cup good-quality red or white wine vinegar","1 tablespoon Dijon mustard","1 tablespoon honey","1/2 teaspoon kosher salt","1/2 garlic clove","1/2 cup vegetable oil","2 tablespoons extra-virgin olive oil","Freshly ground black pepper"],"instructions":"mix","tags":"dressing"}},{"_index":"recipes","_type":"recipes","_id":"sAZnPWMBIdwOg9CN2gfD","_score":1.0,"_source":{"name":"sweet potato cauliflower curry","ingredients":["Ingredients","Print","Curry","","1 Tbsp olive oil","1 onion"," chopped","2 garlic cloves"," minced","1-inch fresh ginger"," peeled/finely grated","2-3 Tbsp fresh cilantro"," chopped (plus more for garnish)","1/2 large head of cauliflower"," cut into florets","2-3 large sweet potatoes"," diced","2 Tbsp red curry paste (or substitute with just tomato paste)","1 Tbsp curry","2 tsp turmeric","1 1/2 tsp coriander","1 1/2 tsp cumin","1 28 oz can chopped tomatoes","1 14 oz can chickpeas"," drained and rinsed","1 14 oz can of coconut milk (full fat or light)","2-3 cups water"],"instructions":["Heat the oil in a large, heavy pot. Add the onions, garlic, ginger,and cilantro; and saute for 5-10 minutes until the onions are very soft and translucent.","","Add the cauliflower and sweet potatoes along with the red curry paste, curry, turmeric, coriander and cumin. Season with salt and pepper and saute for 5 more minutes until the vegetables are well coated with the curry paste and spices and the dish becomes very fragrant.","","Next, add the canned tomatoes with their juices, chickpeas, coconut milk and as much water as you'd like depending on the thickness preference. I usually do about 2 cups of water so that it covers the vegetables slightly.","","Bring to a boil, then turn the heat to low. Simmer for 20 minutes, stirring occasionally, until the cauliflower and potatoes are fork tender.","","Serve over rice and garnish with kale chips if desired."],"tags":"justin friendly"}},{"_index":"recipes","_type":"recipes","_id":"sQZnPWMBIdwOg9CN2gfD","_score":1.0,"_source":{"name":"Black Bean Soup","ingredients":["1 tablespoon olive oil","1 medium onion"," diced","4 cloves garlic"," minced","1 (14.5 ounce) can garlic fire roasted diced tomatoes","4 (15 ounce cans) black beans"," (2 undrained and 2 drained and rinsed)","2 (14.5 ounce) cans low-sodium vegetable broth","1 (4 ounce can) diced green chilies","1 cup frozen corn"," thawed","1½ teaspoons cumin","½-1 teaspoon chili powder","1 tablespoon fresh squeezed lime juice","fresh chopped cilantro for serving"," if desired"],"instructions":["Add two cans of undrained black beans to a food processor and pulse until thickened. Set aside.","Heat oil in a large dutch oven or pot.","Stir in onion and sauté for 3-4 minutes.","Add in garlic and cook for an additional minute.","Stir in the tomatoes, all of the black beans, chicken broth, green chilies, corn, cumin and chili powder.","Bring to a simmer and cook for 10-15 minutes.","If the soup is too thick add more chicken broth. If you would like it thicker puree some of the soup in a blender or food processor.","Take off of the heat and stir in fresh squeeze lime juice.","Season with salt and pepper to taste.","Serve immediately with fresh chopped cilantro for serving."],"tags":["justin friendly","winter"]}},{"_index":"recipes","_type":"recipes","_id":"Baked Tofu with Coconut Kale 2018-05-19","_score":1.0,"_source":{"name":"Baked Tofu with Coconut Kale","ingredients":["1\ttablespoon grapeseed oil (or other neutral oil)","1\ttablespoon sesame oil","3\ttablespoons soy sauce","1\ttablespoon Sriracha","16\tounces firm tofu","3\ttablespoons melted coconut oil","8\tounces lacinato kale or other, see notes above","1\tcup unsweetened coconut flakes"],"instructions":["1. Preheat the oven to 400° F. In a large bowl, whisk together the oils, soy sauce, and Sriracha. Cut the tofu into 1-inch cubes, and place them in the bowl. Gently toss the cubes to coat them in the dressing. Let sit until oven finishes preheating.","","2. Lightly oil a rimmed sheetpan with about a teaspoon of neutral oil. Arrange cubes of tofu on sheetpan, leaving excess dressing in bowl. Bake for 20 minutes. Meanwhile, whisk the 3 tablespoons of melted coconut oil into the reserved dressing. Coarsely chop the kale, discarding the tough ends. Add the kale to the bowl of dressing along with the coconut and toss to coat.","","3. Remove the sheetpan of tofu from the oven. Gently, push the cubes with a spatula to loosen. Nestle the kale and coconut around the tofu cubes. Return pan to the oven and bake for 12 to 15 minutes or until the kale has wilted considerably and is beginning to crisp and the coconut is golden brown. Remove pan from oven. Use a spatula to gently toss everything together. Serve over rice."],"tags":"justin friendly","date_added":"2018-05-19"}},{"_index":"recipes","_type":"recipes","_id":"Buckwheat pancakes 2018-09-02","_score":1.0,"_source":{"name":"Buckwheat pancakes","ingredients":["1 cup / 125 g buckwheat flour*","pinch salt","½ tsp baking powder","½ tsp baking soda","2 tbsp maple syrup","1 tbsp lemon or lime juice","½ cup full fat coconut milk + ½ cup water OR 1 cup of any plant milk","1 heaped tbsp (ideally smooth) almond butter","2 tsp oil for frying (I used sunflower oil)"],"instructions":["In a mixing bowl, combine flour, salt, baking soda and baking powder.","In another bowl, combine all wet ingredients: coconut milk, ½ cup water, maple syrup, lemon juice and almond butter. Whisk everything together until combined and there are no chunks of almond butter in the mixture.","Pour wet ingredients into dry ingredients stirring until you get a homogeneous mixture. Add more water (1-3 tbsp) as needed – depends on how thick your coconut milk was. If you like your pancakes thick add less water, if you prefer them thin add more.","Heat up a frying pan on the stove, brush the pan with a bit of oil using a silicone pastry brush (you can also use an oil spray).","Ladle 2 tablespoons of the pancake mix per pancake. Keep cooking the pancakes until lots of little bubbles form and burst. If you flip them before the bubbles burst they may end up undercooked.","Once bubbles burst, flip pancakes gently. Fry until nicely browned on the other side and serve. Keep cooked pancakes in a warm oven while making the rest."],"tags":"justin friendly","date_added":"2018-09-02"}}]}}
